9/data/attachments/f9b5aed6d3b73e28.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Margaret_whole_Actions_57132_1</nif:username>
            <nif:friendToBeRequested>soap_actions_c830943d-530c-4cd1-ac17-fa57ba46da67</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>